In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series

### lambda

In [ ]:
f = lambda x, y: x + y
f(1, 4)

In [ ]:
def f(x, y):
    return x + y

In [ ]:
f = lambda x: x ** 2
f(3)

In [ ]:
f = lambda x: x + 5
f(3)

In [ ]:
(lambda x: x + 1)(5)

### map & replace

In [3]:
ex = [1, 2, 3, 4, 5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [4]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [5]:
list(map(lambda x: x + 5, ex))
# python 3에는 list를 꼭 붙여줘야함

[6, 7, 8, 9, 10]

In [6]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [11]:
# f = lambda x: x**2
def f(x):
    return x + 5


s1.map(f)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [12]:
z = {1: "A", 2: "B", 3: "C"}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [15]:
s2 = Series(np.arange(10, 30))
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [ ]:
!wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

In [16]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [17]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [20]:
def change_sex(x):
    return 0 if x == "male" else 1


df.sex.map(change_sex)

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [18]:
df["sex_code"] = df.sex.map({"male": 0, "female": 1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [21]:
df.sex.replace({"male": 0, "female": 1})

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [ ]:
df.sex.head(5)

In [ ]:
df.sex.replace(["male", "female"], [0, 1], inplace=True)

In [24]:
df

              earn  height  sex   race  ed  age  sex_code
0     79571.299011   73.89    0  white  16   49         0
1     96396.988643   66.23    1  white  16   62         1
2     48710.666947   63.77    1  white  16   33         1
3     80478.096153   63.22    1  other  16   95         1
4     82089.345498   63.08    1  white  17   43         1
...            ...     ...  ...    ...  ..  ...       ...
1374  30173.380363   71.68    0  white  12   33         0
1375  24853.519514   61.31    1  white  18   86         1
1376  13710.671312   63.64    1  white  12   37         1
1377  95426.014410   71.65    0  white  12   54         0
1378   9575.461857   68.22    0  white  12   31         0

[1379 rows x 7 columns]

In [25]:
del df["sex_code"]

In [26]:
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

### apply & applymap

In [27]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [28]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [34]:
f = lambda x: np.mean(x)
df_info.apply(f)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [38]:
df_info.apply(np.mean)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [37]:
df_info.mean()

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [41]:
def f(x):
    return Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index=["min", "max", "mean", "null"],
    )


df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000

In [44]:
f = lambda x: x // 2
df_info.applymap(f).head(5)

      earn  height  age
0  39785.0    36.0   24
1  48198.0    33.0   31
2  24355.0    31.0   16
3  40239.0    31.0   47
4  41044.0    31.0   21

In [47]:
f = lambda x: x ** 2
df_info["earn"].apply(f)

0       6.331592e+09
1       9.292379e+09
2       2.372729e+09
3       6.476724e+09
4       6.738661e+09
            ...
1374    9.104329e+08
1375    6.176974e+08
1376    1.879825e+08
1377    9.106124e+09
1378    9.168947e+07
Name: earn, Length: 1379, dtype: float64